app/controllers/pay_money_controller.rb

SELECT "baskets".* FROM "baskets" WHERE "baskets"."service_id" = $1 AND (number = 56 AND operation_id = 1) ORDER BY "baskets"."id" ASC LIMIT 1  [["service_id", 1]]
SELECT COUNT(*) FROM "baskets" WHERE "baskets"."service_id" = $1 AND (number = 56 AND operation_id = 1)  [["service_id", 1]]
---
  def index
    @transaction_amount_css = @account_number_css = @password_css = "row-form"
    initialize_customer_view("05ccd7ba3d", "ceiled_transaction_amount", "ceiled_shipping_fee")
    get_service_logo(session[:service].token)

    @transaction_amount = session[:trs_amount]

    # vérifie qu'un numéro panier appartenant à ce service n'existe pas déjà. Si non, on crée un panier temporaire, si oui, on met à jour le montant envoyé par le ecommerce, la monnaie envoyée par celui ci ainsi que le montant, la monnaie et les frais à envoyer au ecommerce
    @basket = Basket.where("number = '#{session[:basket]["basket_number"]}' AND service_id = '#{session[:service].id}' AND operation_id = '#{session[:operation].id}'")
    if @basket.blank?
      @basket = Basket.create(
        number: session[:basket]["basket_number"],
        service_id: session[:service].id,
        operation_id: session[:operation].id,
        original_transaction_amount: session[:trs_amount],
        transaction_amount: session[:trs_amount].to_f.ceil,
        currency_id: session[:currency].id,
        paid_transaction_amount: @transaction_amount,
        paid_currency_id: @wallet_currency.id,
        transaction_id: Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join),
        fees: @shipping,
        rate: @rate,
        login_id: session[:login_id],
        paymoney_account_number: session[:paymoney_account_number],
        paymoney_account_token: session[:paymoney_account_token]
      )

SELECT "baskets".* FROM "baskets" WHERE "baskets"."service_id" = $1 AND (number = 56 AND operation_id = 1) ORDER BY "baskets"."id" ASC LIMIT 1  [["service_id", 1]]
---
      # communication with paymoney
      paymoney_token_url = "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/check2_compte/#{@account_number}"
      @paymoney_token = (RestClient.get(paymoney_token_url) rescue "")
      url = "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/operation_ecommerce/#{@basket.service.ecommerce_profile.token}/#{@basket.operation.paymoney_token}/#{@paymoney_token}/#{session[:basket]["transaction_amount"]}/#{@basket.fees}/0/#{@transaction_id}/#{@password}"