app/controllers/pay_money_controller.rb


      if @status.to_s.strip == "1"
        @transaction_id = Time.now.strftime("%Y%m%d%H%M%S%L")
        @basket = Basket.create(:number => session[:basket]["basket_number"], :service_id => session[:service].id, :payment_status => true, :operation_id => session[:operation].id, :transaction_amount => (session[:basket]["transaction_amount"].to_f + @shipping.to_f), transaction_id: @transaction_id)
---
INSERT INTO "baskets" ("created_at", "number", "operation_id", "payment_status", "service_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Wed, 15 Jan 2014 17:44:35 UTC +00:00], ["number", 56], ["operation_id", 1], ["payment_status", true], ["service_id", 1], ["updated_at", Wed, 15 Jan 2014 17:44:35 UTC +00:00]]