app/controllers/paypal_controller.rb

  def index
    initialize_customer_view("e6da96e284", "unceiled_transaction_amount", "unceiled_shipping_fee")
    get_service_logo(session[:service].token)

    # vérifie qu'un numéro panier appartenant à ce service n'existe pas déjà. Si non, on crée un panier temporaire, si oui, on met à jour le montant envoyé par le ecommerce, la monnaie envoyée par celui ci ainsi que le montant, la monnaie et les frais à envoyer au ecommerce
    @basket = PaypalBasket.where("number = '#{session[:basket]["basket_number"]}' AND service_id = '#{session[:service].id}' AND operation_id = '#{session[:operation].id}'")

    set_cashout_fee

    @shipping = @shipping + 1

    if @basket.blank?
      @basket = PaypalBasket.create(
        number: session[:basket]["basket_number"],
        service_id: session[:service].id,
        operation_id: session[:operation].id,
        original_transaction_amount: session[:trs_amount],
        transaction_amount: session[:trs_amount],
        currency_id: session[:currency].id,
        paid_transaction_amount: @transaction_amount,
        paid_currency_id: @wallet_currency.id,
        transaction_id: Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join),
        fees: @shipping,
        rate: @rate,
        login_id: session[:login_id],
        paymoney_account_number: session[:paymoney_account_number],
        paymoney_account_token: session[:paymoney_account_token],
        paymoney_password: session[:paymoney_password]
      )
---
INSERT INTO "paypal_baskets" ("created_at", "number", "operation_id", "service_id", "transaction_amount", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 21 Jan 2014 08:17:46 UTC +00:00], ["number", "56"], ["operation_id", 1], ["service_id", 1], ["transaction_amount", 9996.0], ["updated_at", Tue, 21 Jan 2014 08:17:46 UTC +00:00]]
SELECT COUNT(*) FROM "baskets" WHERE "baskets"."service_id" = $1 AND (number = '0' AND operation_id = 2)  [["service_id", 1]]
SELECT COUNT(*) FROM "paypal_baskets" WHERE "paypal_baskets"."service_id" = $1 AND (number = '0' AND operation_id = 1)  [["service_id", 1]]